In [1]:
import pandas as pd

basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics['genres_split'] = basics['genres'].str.split(',')
#deletelist1=
basics = basics.drop(['titleType', 'originalTitle','isAdult'], axis=1)
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,Life of a Beijing Policeman,2013,NaN,120,"Drama,History","[Drama, History]"
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama,[Drama]
3,tt0069049,The Other Side of the Wind,2018,NaN,122,Drama,[Drama]
4,tt0088751,The Naked Monster,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...
81741,tt9914942,Life Without Sara Amat,2019,NaN,74,Drama,[Drama]
81742,tt9915872,The Last White Witch,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81743,tt9916170,The Rehearsal,2019,NaN,51,Drama,[Drama]
81744,tt9916190,Safeguard,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81745,tt9916362,Coven,2020,NaN,92,"Drama,History","[Drama, History]"

In [2]:
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
ratings

           tconst  averageRating  numVotes
0       tt0000001            5.7      1979
1       tt0000002            5.8       265
2       tt0000005            6.2      2621
3       tt0000006            5.1       182
4       tt0000007            5.4       821
...           ...            ...       ...
500667  tt9916200            8.1       229
500668  tt9916204            8.2       262
500669  tt9916348            8.3        18
500670  tt9916362            6.4      5370
500671  tt9916428            3.8        14

[500672 rows x 3 columns]

In [3]:
TMDBAPI = pd.read_csv("Data/tmdb_results_combined.csv.gz", low_memory = False)
TMDBAPI = TMDBAPI[['imdb_id', 'revenue', 'budget', 'certification']]
TMDBAPI = TMDBAPI.drop(TMDBAPI.index[0])
TMDBAPI= TMDBAPI.reset_index(drop=True)
TMDBAPI

        imdb_id     revenue      budget certification
0     tt0113026         0.0  10000000.0           NaN
1     tt0113092         0.0         0.0           NaN
2     tt0116391         0.0         0.0           NaN
3     tt0118694  14204632.0    150000.0            PG
4     tt0118852         0.0         0.0             R
...         ...         ...         ...           ...
2571  tt7797790         0.0         0.0           NaN
2572  tt8665056         0.0         0.0           NaN
2573  tt8795764         0.0         0.0            NR
2574  tt9071078         0.0         0.0           NaN
2575  tt9212730         0.0         0.0           NaN

[2576 rows x 4 columns]

In [4]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,Life of a Beijing Policeman,2013,NaN,120,"Drama,History",Drama
1,tt0043139,Life of a Beijing Policeman,2013,NaN,120,"Drama,History",History
...,...,...,...,...,...,...,...
81744,tt9916190,Safeguard,2020,NaN,95,"Action,Adventure,Thriller",Action
81744,tt9916190,Safeguard,2020,NaN,95,"Action,Adventure,Thriller",Adventure
81744,tt9916190,Safeguard,2020,NaN,95,"Action,Adventure,Thriller",Thriller
81745,tt9916362,Coven,2020,NaN,92,"Drama,History",Drama
81745,tt9916362,Coven,2020,NaN,92,"Drama,History",History

In [5]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [6]:
title_genres=exploded_genres[['tconst', 'genres_split']].copy()
title_genres = title_genres.rename(columns={'genres_split': 'genre_ID'})
title_genres.head()

      tconst genre_ID
0  tt0035423   Comedy
0  tt0035423  Fantasy
0  tt0035423  Romance
1  tt0043139    Drama
1  tt0043139  History

In [7]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [8]:
## make new integer genre_id and drop string genres
exploded_genres['genre_id'] = exploded_genres['genres_split'].map(genre_map)
exploded_genres = exploded_genres.drop(columns='genres_split')

In [9]:
genre_lookup=pd.DataFrame({'Genre_Name': genre_map.keys(), 'Genre_ID':genre_map.values()})
genre_lookup

    Genre_Name  Genre_ID
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Sport        20
21   Talk-Show        21
22    Thriller        22
23         War        23
24     Western        24

In [10]:
basics = basics.drop(['genres', 'genres_split'], axis=1)
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0043139,Life of a Beijing Policeman,2013,NaN,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
3,tt0069049,The Other Side of the Wind,2018,NaN,122
4,tt0088751,The Naked Monster,2005,NaN,100
...,...,...,...,...,...
81741,tt9914942,Life Without Sara Amat,2019,NaN,74
81742,tt9915872,The Last White Witch,2019,NaN,97
81743,tt9916170,The Rehearsal,2019,NaN,51
81744,tt9916190,Safeguard,2020,NaN,95
81745,tt9916362,Coven,2020,NaN,92

In [11]:
import json
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
with open('/Users/jakec/.secret/mySQL.json', 'r') as f:
    login = json.load(f)
## Display the keys of the loaded dict
login.keys()

dict_keys(['username', 'password'])

In [12]:
username = 'root' # default username for MySQL db is root
password = 'Snakeking3!' # whatever password you chose during MySQL installation.

connection_str = f'mysql+pymysql://{username}:{password}@localhost/Movies'
engine = create_engine(connection_str)

In [13]:
# check if database exists, if not, create it
if database_exists(connection_str):
    print('It exists')
else:
    create_database(connection_str)
    print('Database created!')

It exists

In [14]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [15]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

81746

In [16]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [17]:
key_len2 = ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema2 = {
    "tconst": String(key_len2+1), 
    "averageRating": Float(),
    'numVotes':Integer()}

In [18]:
ratings.to_sql('title_ratings',engine,dtype=df_schema2,if_exists='replace',index=False)

500672

In [19]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [20]:
title_genres.to_sql('title_genres',engine,if_exists='replace',index=False)

153165

In [21]:
genre_lookup.to_sql('genres', engine, if_exists='replace', index=False)

25

In [22]:
key_len3 = TMDBAPI['imdb_id'].fillna('').map(len).max()
title_len3 = TMDBAPI['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema3 = {
    "imdb_id": String(key_len3+1), 
    "revenue": Float(),
    "Budget": Float(),
    'certification':String(title_len3+1)}

In [23]:
TMDBAPI.to_sql('tmdb_data',engine,dtype=df_schema3,if_exists='replace',index=False)

2576

In [24]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [25]:
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0043139,Life of a Beijing Policeman,2013.0,None,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
3,tt0069049,The Other Side of the Wind,2018.0,None,122
4,tt0088751,The Naked Monster,2005.0,None,100

In [26]:
q = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1979
1  tt0000002            5.8       265
2  tt0000005            6.2      2621
3  tt0000006            5.1       182
4  tt0000007            5.4       821

In [27]:
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q, engine)

      tconst genre_ID
0  tt0035423   Comedy
1  tt0035423  Fantasy
2  tt0035423  Romance
3  tt0043139    Drama
4  tt0043139  History

In [28]:
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [29]:
q = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0035423  76019000.0  48000000.0         PG-13
2  tt0113026         0.0  10000000.0          None
3  tt0113092         0.0         0.0          None
4  tt0114447         0.0         0.0          None

In [30]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data